In [1]:
import pandas as pd

In [2]:
member = pd.Series(['홍','전', '강', '스'])

In [3]:
member

0    홍
1    전
2    강
3    스
dtype: object

In [4]:
member[1]

'전'

In [5]:
member = pd.Series(['홍','전','강','스'],
                  index = ['1번','2번','3번','4번'])

In [6]:
member

1번    홍
2번    전
3번    강
4번    스
dtype: object

In [7]:
sal_1 = { '홍': 100, '일' : 130, '전' : 120}

In [10]:
sal_2 = pd.Series(sal_1)

In [11]:
sal_2

홍    100
일    130
전    120
dtype: int64

In [12]:
member

1번    홍
2번    전
3번    강
4번    스
dtype: object

In [13]:
member[0]

'홍'

In [14]:
member['1번']

'홍'

In [15]:
member[['1번', '3번']]

1번    홍
3번    강
dtype: object

In [16]:
member[:3]

1번    홍
2번    전
3번    강
dtype: object

In [17]:
member[:3:2]

1번    홍
3번    강
dtype: object

In [18]:
sal_2

홍    100
일    130
전    120
dtype: int64

In [19]:
sal_3 = {'홍' : 10, '전' : 12, '강' : 20}

In [21]:
sal_4 = pd.Series(sal_3)

In [22]:
sal_3

{'홍': 10, '전': 12, '강': 20}

In [23]:
sal_4

홍    10
전    12
강    20
dtype: int64

In [24]:
print(sal_2 + sal_4)

강      NaN
일      NaN
전    132.0
홍    110.0
dtype: float64

In [25]:
print(sal_4 - sal_2)

강      NaN
일      NaN
전   -108.0
홍    -90.0
dtype: float64

In [26]:
member3 = {'번호' : ['1번', '2번', '3번'],
           '이름' : ['홍', '전', '강'], 
           '생일' : [1975, 1980, 1992]}

In [27]:
member3

{'번호': ['1번', '2번', '3번'], '이름': ['홍', '전', '강'], '생일': [1975, 1980, 1992]}

In [28]:
member4 = pd.DataFrame(member3)

In [29]:
member4

   번호 이름    생일
0  1번  홍  1975
1  2번  전  1980
2  3번  강  1992

In [30]:
member5 = pd.DataFrame(member3, columns = ['이름', '번호', '생일'])

In [31]:
member5

  이름  번호    생일
0  홍  1번  1975
1  전  2번  1980
2  강  3번  1992

In [32]:
member5['생일']

0    1975
1    1980
2    1992
Name: 생일, dtype: int64

In [35]:
member5[['이름','생일']]

  이름    생일
0  홍  1975
1  전  1980
2  강  1992

In [39]:
member5.loc[[0]]

  이름  번호    생일
0  홍  1번  1975

In [40]:
member5.loc[0]

이름       홍
번호      1번
생일    1975
Name: 0, dtype: object

In [41]:
member5.loc[member5['번호'] >= '2번']

  이름  번호    생일
1  전  2번  1980
2  강  3번  1992

In [42]:
member6 = {'번호' : ['1번','2번','3번','4번','5번'], 
           '이름' : ['홍', '전', ' 강', ' 홍', '일'], 
           '매출' : [100, 200, 250, 300, 150]}

In [45]:
member7 = pd.DataFrame(member6, columns = ['번호', '이름', '매출'])

In [46]:
member7

   번호  이름   매출
0  1번   홍  100
1  2번   전  200
2  3번   강  250
3  4번   홍  300
4  5번   일  150

In [53]:
member7.loc[(member7['매출'] >= 100) & (member7['매출'] <= 200)]

   번호 이름   매출
0  1번  홍  100
1  2번  전  200
4  5번  일  150

In [54]:
member8 = pd.DataFrame(member5, columns = ['번호', '이름', '생일', '지역'])

In [55]:
member8

   번호 이름    생일  지역
0  1번  홍  1975 NaN
1  2번  전  1980 NaN
2  3번  강  1992 NaN

In [56]:
member8['지역'] = ['서울','부산','대전']

In [57]:
member8

   번호 이름    생일  지역
0  1번  홍  1975  서울
1  2번  전  1980  부산
2  3번  강  1992  대전

In [58]:
member8.loc[3] = ['4번', '호', 1985, '대구']

In [59]:
member8

   번호 이름    생일  지역
0  1번  홍  1975  서울
1  2번  전  1980  부산
2  3번  강  1992  대전
3  4번  호  1985  대구

In [62]:
member8.drop(member8[member8.생일 > 1980].index)

   번호 이름    생일  지역
0  1번  홍  1975  서울
1  2번  전  1980  부산